|Сценарий|Действие|Ожидаемый результат|Фактический результат| Оценка|
|:---|:---|:---|:---|:---|
|1-1: Правильное отображение экрана при выборе тренироки на скорость | Открыть приложение, перейти в экран настроек, выбрать тренировку на скорость и сохранить выбор | При переходе к экрану тренировлок и начале тренировки выведен выбранный текст (текст песни)||Тест пройден|
|1-2: Правильное отображение экрана при выборе тренироки на обучение | Открыть приложение, перейти в экран настроек, выбрать тренировку на обучение и сохранить выбор | При переходе к экрану тренировлок и начале тренировки выведен набор символов в зависимости от выставленного уровня ||Тест пройден|
|2-1: Корректность сгенерированного текста в зависимости от выбранного уровня | Выбрать тренировку на обучения и пройти ее для всех уровней | С увеличением уровня добавляются новые символы ||Тест пройден|
|3-1: Правильность выводимого результата при полностю корректном наборе текста | Выбрать тренировку на обучения и пройти ее не совершив ошибок при наборе текста |На экран выведен результат: количество ошибок - 0, правильность - 100%. Произошел переход на новый уровень||Тест пройден|
|3-2: Правильность выводимого результата при совершении допустимого количества ошибок | Выбрать тренировку на обучения и пройти ее допустив ... ошибки при наборе текста |||Тест пройден|
|3-3: Правильность выводимого результата при совершении критического количества ошибок | Выбрать тренировку на обучения и пройти ее допустив ... ошибки при наборе текста |||Тест пройден|
|4-1: Правильность выводимого результата | Выбрать тренировку на скорость, тестовый текст - текст3. Набироать символы с интервалом в 1 секунду при помощи секундомера |На экран выведен результат: скорость печати - 0||Тест пройден|
|5-1: Смена фона на заданный по всему приложению | Перейти на страницу настроек, выбрать цвет фона и сохранить выбор. Затем открыть другие экраны приложения | Фон всех экранов соответствует заданному ||Тест пройден|
